[
  {
    "que": "What section on a task record would you use to see the most recent update made to a record?",
    "opt": [
      "Journal",
      "Timeline",
      "update log",
      "audit log",
      "diary",
      "activity"
    ],
    "ans": "F",
    "explaination": "activity"
  },
  {
    "que": "What are examples of UI actions, relating to lists? choose four answers?",
    "opt": [
      "List buttons",
      "list context menu",
      "list choices",
      "list links",
      "list control",
      "lists overwrite"
    ],
    "ans": "A,B,C,D",
    "explaination": "List buttons<br />list context menu<br />list choices<br />list links"
  },
  {
    "que": "which feature allows you to automate business logic for a particular application or process such as approvals, task, notifications, and record Operations?",
    "opt": [
      "Flows",
      "Action sequence",
      "Flow diagrams",
      "action sets",
      "task flows"
    ],
    "ans": "A",
    "explaination": "Flows"
  },
  {
    "que": "when a Flow runs an action, it generates a runtime value, which stays the same for the duration of the flow. what is the name of that runtime value?",
    "opt": [
      "data pill runtime value",
      "sequence runtime value",
      "starting runtime value",
      "trigger runtime value",
      "input runtime value"
    ],
    "ans": "A",
    "explaination": "data pill runtime value"
  },
  {
    "que": "the employee on-boarding team has asked for a way for managers to order computers, monitors, business cards, and cell phones for new employees. how would you proceed to meet this requirement?",
    "opt": [
      "create order guide",
      "create requested item",
      "create record producer",
      "create on boarding bot"
    ],
    "ans": "A",
    "explaination": "create order guide"
  },
  {
    "que": "which resource would you use to determine if a specific user could contribute to a particular knowledge base?",
    "opt": [
      "User criteria diagnostics",
      "Sn_kb_author role",
      "User criteria job log",
      "knowledge author group",
      "KB author group"
    ],
    "ans": "A",
    "explaination": "User criteria diagnostics"
  },
  {
    "que": "If a knowledge base has no access details specified. what users are able to read articles in that knowledge base?",
    "opt": [
      "no users",
      "itil users",
      "users with kb_user role",
      "any user with an articles for permalink",
      "any active user"
    ],
    "ans": "E",
    "explaination": "any active user"
  },
  {
    "que": "while showing a customer their incident form, they ask to change the priority field title to display their internal terminology Pvalue. how would you do that? choose two answers?",
    "opt": [
      "right click on priority and select configure dictionary",
      "right click on priority and select configure label",
      "right click on priority and select configure display settings",
      "right click on priority and select configure column"
    ],
    "ans": "A,B",
    "explaination": "right click on priority and select configure dictionary<br />right click on priority and select configure label"
  },
  {
    "que": "what access does a user need to be able to import articles to a knowledge base?",
    "opt": [
      "Sn_Knowledge_import",
      "Sn_knowledge_contribute",
      "can contribute",
      "sn_knowledge_write",
      "can write",
      "can import"
    ],
    "ans": "C",
    "explaination": "can contribute"
  },
  {
    "que": "what controls the publishing and retiring process for knowledge articles?",
    "opt": [
      "workflow designer",
      "workflows",
      "state life cycle",
      "approval policies",
      "approval definitions"
    ],
    "ans": "B",
    "explaination": "workflows"
  },
  {
    "que": "what is an advantage of defining relationship types between ci classes?",
    "opt": [
      "Improves data quality, as the CIs will automatically be related when CMDB is activated.",
      "it prevents users from relating CIs incorrectly.",
      "it automates the loading of the ci dependency view.",
      "makes relating CIs easier, because predefined relationship suggests which type of CIs should be"
    ],
    "ans": "D",
    "explaination": "makes relating CIs easier, because predefined relationship suggests which type of CIs should be"
  },
  {
    "que": "when using the CI dependency view, how would you view the relationship between one CI and another CI?",
    "opt": [
      "right click, view relationship",
      "Click on the plus to expand cluster",
      "click down arrow, view relationship",
      "Hover on connection line"
    ],
    "ans": "D",
    "explaination": "Hover on connection line"
  },
  {
    "que": "Of the Ci tables, which is a base table of the CMDB hierarchy?",
    "opt": [
      "ECMDB",
      "Cmdb_rel_ci",
      "Cmdb_ci",
      "cmdb",
      "Ecmdb_rel_ci",
      "Ecmdb_ci"
    ],
    "ans": "D",
    "explaination": "cmdb"
  },
  {
    "que": "what table acts as a staging area for records imported from a data source?",
    "opt": [
      "staging table",
      "temp table",
      "transform table",
      "import set row table"
    ],
    "ans": "D",
    "explaination": "import set row table"
  },
  {
    "que": "which field (or fields) is used as a unique key during imports?",
    "opt": [
      "Sys IDs",
      "match fields",
      "coalesce fields",
      "key fields"
    ],
    "ans": "C",
    "explaination": "coalesce fields"
  },
  {
    "que": "what module enables an administrator to define destinations for imported data on any ServiceNow table?",
    "opt": [
      "field transform",
      "schema map",
      "import map",
      "transform map"
    ],
    "ans": "D",
    "explaination": "transform map"
  },
  {
    "que": "the customer wants all users to have access to the records in the offerings table. what setting on access control definition would you use to grant access to all of the offering table records?",
    "opt": [
      "Offering.None",
      "None. Offering",
      "Offering.Name",
      "Offering"
    ],
    "ans": "A",
    "explaination": "Offering.None"
  },
  {
    "que": "a manager wants to review a snapshot of month end sales performance data, as compared to sales target. in addition, the manager wants to able to see those monthly numbers trended overtime and forecasted into the future. what capability do you suggest for this manager?",
    "opt": [
      "schedule reports, accustoms snapshot table and projection report",
      "scheduled reports, a custom snapshot table and a trend report.",
      "performance analytics.",
      "scheduled reports and excel",
      "key performance indicators."
    ],
    "ans": "C",
    "explaination": "performance analytics."
  },
  {
    "que": "which component of a table contains a piece of data for one record?",
    "opt": [
      "Field",
      "Factor",
      "data point",
      "item",
      "element"
    ],
    "ans": "A",
    "explaination": "Field"
  },
  {
    "que": "what do you click when you have made modifications to your report, and you want to see the results without saving?",
    "opt": [
      "Run",
      "Execute",
      "Test",
      "Preview",
      "try it"
    ],
    "ans": "A",
    "explaination": "Run"
  },
  {
    "que": "The report designer contains different sections for configuring your report. which section is used to specify grouping and calculations to be run against the data?",
    "opt": [
      "Data",
      "Format",
      "Configure",
      "Style",
      "group by"
    ],
    "ans": "C",
    "explaination": "Configure"
  },
  {
    "que": "what section on the notes tab shows the history of the work documented on the record?",
    "opt": [
      "Journal",
      "Activity",
      "Timeline",
      "audit log",
      "diary"
    ],
    "ans": "B",
    "explaination": "Activity"
  },
  {
    "que": "Your customer wants to update a notification, so it is sent to the caller and also to the manager of the caller. how would you approach this requirement?",
    "opt": [
      "Set who will receive to subscribable",
      "on the send to tab, add caller field, dot walk to caller’s manager to add manager.",
      "Create workflow and include a notification in the workflow",
      "on who will receive tab, select copy manager checkbox.",
      "on who will receive tab, add caller field, dot walk to caller’s Manager to add managers."
    ],
    "ans": "E",
    "explaination": "on who will receive tab, add caller field, dot walk to caller’s Manager to add managers."
  },
  {
    "que": "An IT User calls the service desk Because they need to work on task records. all they can see his self-service on their homepage when they log into the service now instance. what issue could explain this? choose two answers?",
    "opt": [
      "their user record was not approved by their managers",
      "that user account does not belong to any group which contains the ITIL role.",
      "their user account is not logged in property",
      "their user account does not have itil role",
      "That user account failed LDAP authentication"
    ],
    "ans": "B,D",
    "explaination": "that user account does not belong to any group which contains the ITIL role.<br />their user account does not have itil role"
  },
  {
    "que": "What type of rules specify which user groups are responsible to work on different types of tasks?",
    "opt": [
      "On call",
      "Assignment",
      "Routing",
      "Calendar",
      "Escalation"
    ],
    "ans": "B",
    "explaination": "Assignment"
  },
  {
    "que": "using the module. system properties> my company. what branding options are available?",
    "opt": [
      "banner image, banner text, colour scheme",
      "company name, company logo",
      "banner image, banner text",
      "company name, company logo, colour scheme"
    ],
    "ans": "C",
    "explaination": "banner image, banner text"
  },
  {
    "que": "From form designer, how would you define a section, so it displays as a tab?",
    "opt": [
      "Click the gear and check the tab option",
      "Click context menu > configure tabs",
      "add .tab to the end of the section name",
      "add _tap to the end of the section name",
      "name the section"
    ],
    "ans": "E",
    "explaination": "name the section"
  },
  {
    "que": "When looking at a long list of records, you want to quickly filter, to show only those which have category of hardware. How might you do that?",
    "opt": [
      "on breadcrumbs, click > icon, type hardware and click enter",
      "right click on the magnifier, type hardware and click enter",
      "click funnel icon, type hardware and click enter.",
      "on the list, locate and right click on the value Hardware, select show matching",
      "on the category column header, right click and select show > hardware."
    ],
    "ans": "D",
    "explaination": "on the list, locate and right click on the value Hardware, select show matching"
  },
  {
    "que": "groups are defined at what?",
    "opt": [
      "An escalation pod",
      "a collection of subject matter experts",
      "a department",
      "A team of users",
      "A collection of users"
    ],
    "ans": "E",
    "explaination": "A collection of users"
  },
  {
    "que": "what is the best way to learn about performance analytics?",
    "opt": [
      "use the ServiceNow wiki",
      "schedule a demo with ServiceNow sales team",
      "take a service now performance analytics course on now learning",
      "activate the plugin on your production environment and start the default data collectors."
    ],
    "ans": "C",
    "explaination": "take a service now performance analytics course on now learning"
  },
  {
    "que": "A subject matter expert routinely receives task which have been worked by first and level support before receiving the assignment. what could you suggest, to make it easier for the expert to read only the work notes in the activity log?",
    "opt": [
      "click contexts menu > work notes view",
      "click funnel icon and select only work notes",
      "click Context menu > history",
      "click personalise icon and select activity stream",
      "right click form header > form layout > add work note section"
    ],
    "ans": "B",
    "explaination": "click funnel icon and select only work notes"
  },
  {
    "que": "for a customer’s inventory application, several inventory applications fields on a needed-on inventory ticket. this ticket will be assigned to inventory support team members. how would you start to implement this requirement?",
    "opt": [
      "create inventory table as a new base table. then add inventory specification fields as needed.",
      "create inventory table with the inventory specification fields. in create view between the inventory and task table.",
      "create the inventory table with the inventory specification fields. then create many to many relationships between the inventory and the task table.",
      "create inventory table as an extended table from the task table. then add the inventory specification fields, as needed."
    ],
    "ans": "D",
    "explaination": "create inventory table as an extended table from the task table. then add the inventory specification fields, as needed."
  },
  {
    "que": "when using the report designer, it is best practice to make copy of an existing report then make modification to your copy of that report. when viewing the report inside the designer, how would you make a copy of the report?",
    "opt": [
      "click on the paper icon and select create new.",
      "click on the down triangle and select insert and stay",
      "click on the properties tab and select save as",
      "click on context menu and select insert and stay",
      "click on the funnel icon and create copy"
    ],
    "ans": "B",
    "explaination": "click on the down triangle and select insert and stay"
  },
  {
    "que": "while testing a catalog item for ordering an expensive computer, the mandatory approval is being skipped for requester Bob Smith, but not for any of the other requests. what could explain the issue?",
    "opt": [
      "the manager does not have a delegate assigned",
      "there is a business rule, excluding bob Smith with from any approvals",
      "the Bob Smith user account, does not have a manager specified",
      "Bob Smith is a VIP",
      "Bob Smith does not have a delegate set up on his account"
    ],
    "ans": "C",
    "explaination": "Bob Smith is a VIP"
  },
  {
    "que": "what module do you use to access the report that are available to you?",
    "opt": [
      "self-service> my reports",
      "reports> overview",
      "report's> home page",
      "report's> view/run",
      "self-service> my dashboards"
    ],
    "ans": "D",
    "explaination": "report's> view/run"
  },
  {
    "que": "Why is it recommended that you Limit update sets to maximum of 100 records? Choose 2 answers?",
    "opt": [
      "Comply with ISO audit requirements",
      "smaller update sets can be imported to production during business hours",
      "reduce potential conflicts",
      "improve ability to troubleshoot issues with the default update set",
      "make it easier to identify and review changes",
      "keeps update set logs shorter",
      "Make it easier for developers to organise their work"
    ],
    "ans": "C,E",
    "explaination": "reduce potential conflicts<br />make it easier to identify and review changes"
  },
  {
    "que": "which flow components allow you to specify when a flow should be run?",
    "opt": [
      "Trigger and condition",
      "trigger and condition pill",
      "condition and table",
      "scope and trigger condition",
      "trigger criteria and clock"
    ],
    "ans": "A",
    "explaination": "Trigger and condition"
  },
  {
    "que": "a customer has asked for the following updates to a form: make resolution code mandatory, when state is changed to resolved, hide major incident checkbox, unless logged in user as major incident manager role. what type of rules would you use to implement this requirement?",
    "opt": [
      "field Lipper",
      "UI policy and actions",
      "UI design",
      "dictionary design",
      "form constraint"
    ],
    "ans": "B",
    "explaination": "UI policy and actions"
  },
  {
    "que": "what utility enables process owners to other cross enterprise workflows within a single unified process?",
    "opt": [
      "Flow editor",
      "floor designer",
      "workflow manager",
      "process owner dashboard",
      "process workflow designer",
      "process automation designer",
      "process flow manager"
    ],
    "ans": "F",
    "explaination": "process automation designer"
  },
  {
    "que": "which type of script runs in the browser?",
    "opt": [
      "flow designer actions",
      "script includes",
      "business rules",
      "ACL scripts",
      "transform maps",
      "UI policies and client scripts"
    ],
    "ans": "F",
    "explaination": "UI policies and client scripts"
  },
  {
    "que": "it time for end user is based on the round trip between the client and the server. What activities are included in the round trips?",
    "opt": [
      "Submit + query",
      "request + response",
      "insert + verify",
      "save + update",
      "write + read"
    ],
    "ans": "B",
    "explaination": "request + response"
  },
  {
    "que": "What instance resource allows you to access guided tours, information about actions, and instruction on how to use inputs and outputs in your flow?",
    "opt": [
      "Getting started",
      "Wiki",
      "help panel",
      "Docs",
      "user guide",
      "community"
    ],
    "ans": "A",
    "explaination": "Getting started"
  },
  {
    "que": "here is as example of the criteria set for a knowledge base: Companies: ACME North America, department: HR, groups: ACME MANAGERS, Match all: yes. in this example, what user would have access to this knowledge base?",
    "opt": [
      "members of the acme managers group, and HR department, regardless of geography.",
      "Employees of the ACME North America, who are members of HR department or the ACME managers group",
      "members of the ACME Manager group, who are also members of HR departments and part of ACME North America",
      "users which are members of either ACME North America, or HR department or ACME Managers group"
    ],
    "ans": "C",
    "explaination": "members of the ACME Manager group, who are also members of HR departments and part of ACME North America"
  },
  {
    "que": "What is a set of condition applied to a table list to show as subset of the data?",
    "opt": [
      "Mask",
      "Divisor",
      "Filter",
      "Funnel",
      "Query"
    ],
    "ans": "C",
    "explaination": "Filter"
  },
  {
    "que": "what are the different ways you can create a favourite for a particular record? Choose two answers?",
    "opt": [
      "from the record related links, click add favourites",
      "from the record form header, click the star icon",
      "from the record form header, click additional action menus and select create favourite",
      "from list, click the star icon",
      "from list, drag record number to favourites on the navigator.",
      "from the record form header, click paperclip icon."
    ],
    "ans": "C,E",
    "explaination": "from the record form header, click additional action menus and select create favourite<br />from list, drag record number to favourites on the navigator."
  },
  {
    "que": "if you have the impersonate role, what type of user are you not able to impersonate?",
    "opt": [
      "Extended security admin",
      "security desk users",
      "special agents",
      "government customers",
      "security incident response users"
    ],
    "ans": "A",
    "explaination": "Extended security admin"
  },
  {
    "que": "on a list, what part of the table, does each column show?",
    "opt": [
      "an element",
      "a relationship",
      "a record",
      "a attribute",
      "a Field"
    ],
    "ans": "E",
    "explaination": "a Field"
  },
  {
    "que": "Which type of field allows you to enter freely using letters, numbers, and special characters?",
    "opt": [
      "multi line text",
      "single line text",
      "open text",
      "text",
      "string"
    ],
    "ans": "E",
    "explaination": "string"
  },
  {
    "que": "To quickly return to your instances home page, what item would you click?",
    "opt": [
      "star icon",
      "shortcuts icon",
      "navigation header",
      "gear icon",
      "instance logo",
      "user menu"
    ],
    "ans": "E",
    "explaination": "instance logo"
  },
  {
    "que": "Which admin role is required to make changes to high security setting?",
    "opt": [
      "Ad_admin",
      "High_sec_admin",
      "Sn_ad_admin",
      "Admin",
      "Security_admin"
    ],
    "ans": "E",
    "explaination": "Security_admin"
  },
  {
    "que": "with the admin role, a user would have access to all platform features, functions, and data with what exceptions?",
    "opt": [
      "High security and human resources",
      "human resources and security operations",
      "employee personality identification information and security operations",
      "human resource and enterprise CMDB",
      "security operations and vulnerability response"
    ],
    "ans": "B",
    "explaination": "human resources and security operations"
  },
  {
    "que": "from the my approval module, you want to quickly authorize a request. how can you do this quickly from the list view?",
    "opt": [
      "right click on the requested state, select approve",
      "right click on the approval number, select approve",
      "select approval record by checking box, click on green check",
      "right click on the approval number, select approved, click green check"
    ],
    "ans": "B",
    "explaination": "right click on the approval number, select approve"
  },
  {
    "que": "what attributes you can manage using system properties> basic configuration UI16? Choose five answers?",
    "opt": [
      "default calendar",
      "default region",
      "base theme",
      "preferred browser",
      "font style",
      "banner image",
      "start-up sound",
      "browser tab title",
      "animation style",
      "user photo icon on/off",
      "module text colour",
      "header background colour",
      "default homepage"
    ],
    "ans": "C,F,H,K,L",
    "explaination": "base theme<br />banner image<br />browser tab title<br />module text colour<br />header background colour"
  },
  {
    "que": "What module do you use to access the full screen view of connect?",
    "opt": [
      "Connect> dashboard",
      "Connect> workspace",
      "Connect> connect chat",
      "Connect> tools> workspace",
      "Connect> agent workspace"
    ],
    "ans": "C",
    "explaination": "Connect> connect chat"
  },
  {
    "que": "A new employee joins the IT department and needs to perform work assigned to network and Hardware groups. how would you set up their access? Choose 3 answers?",
    "opt": [
      "add user account to hardware group",
      "add user account to ACL",
      "add user account to itil group",
      "Create user account",
      "add user account to IT knowledge base",
      "add user account to network group"
    ],
    "ans": "A,D,F",
    "explaination": "add user account to hardware group<br />Create user account<br />add user account to network group"
  },
  {
    "que": "when would you use the following steps? i) Homepage admin > pages ii) Right click on homepage record iii) select unload portal page",
    "opt": [
      "to add a homepage to an update set",
      "to delete homepage",
      "to publish a homepage to the portal",
      "to retire homepage"
    ],
    "ans": "A",
    "explaination": "to add a homepage to an update set"
  },
  {
    "que": "On a business rule, when setting determines at what points the rule executes. what are the options for specifying that timing?",
    "opt": [
      "Prior to, synchronous, on update",
      "Insert, update, delete, query",
      "Before, synchronous, schedule job, views",
      "Before, after, Async, display"
    ],
    "ans": "D",
    "explaination": "Before, after, Async, display"
  },
  {
    "que": "what is the language used for scripting in the ServiceNow?",
    "opt": [
      "Perl",
      "Python",
      "JavaScript",
      "C++",
      "PHP",
      "Glide"
    ],
    "ans": "C",
    "explaination": "JavaScript"
  },
  {
    "que": "which script can run when a record is displayed, inserted, updated, deleted or when a table is queried?",
    "opt": [
      "client script",
      "business rule",
      "UI script",
      "scheduled job",
      "record rule"
    ],
    "ans": "B",
    "explaination": "business rule"
  },
  {
    "que": "what process allows user to create, categorise, review, approve and browse important information in a centralised location that is shared by the entire organization?",
    "opt": [
      "Self-service management",
      "Knowledge-centered management",
      "knowledge management",
      "business information management",
      "information portal management"
    ],
    "ans": "C",
    "explaination": "knowledge management"
  },
  {
    "que": "Which storefront is a single location for accessing prebuilt spokes, to quickly integrate with 3rd party services to build and share content?",
    "opt": [
      "integration portal",
      "integration store",
      "service now spoke store",
      "integration one stop",
      "ServiceNow store",
      "integration spoke hub",
      "spoke store"
    ],
    "ans": "E",
    "explaination": "ServiceNow store"
  },
  {
    "que": "which role can manage multiple knowledge bases?",
    "opt": [
      "Sn_kb_admin",
      "Kb_Admin",
      "Knowledge_admin",
      "Knowledge_base_admin"
    ],
    "ans": "C",
    "explaination": "Knowledge_admin"
  },
  {
    "que": "You are creating a catalog item for ordering a new desktop computer. The computer have these options: colour: black or silver, ram: 32 MB or 64 MB, keyboard: standard or economic,monitor: 24 inch or 32 inch. how would you add this option to the catalog item form?",
    "opt": [
      "add choices",
      "add UI options",
      "add variables",
      "add fields"
    ],
    "ans": "C",
    "explaination": "add variables"
  },
  {
    "que": "A service catalog project will involve building 80 catalog items. for each of the catalog items, the following fields will be mandatory on the forms: requested for, requested by, approving manager, delivery instructions. all of the other variables will be specific to the individual catalog item. what features would you use when designing the catalog item form?",
    "opt": [
      "create an order guide which includes all variables; then copy and hide variables as needed.",
      "create one variable set for the four variables; then add the variable set to each of the eighty catalog items",
      "create a variable set template; they apply to all of the catalog items",
      "create a record producer that contains the four fields; then add to the record producer related list on the catalog items",
      "create a floor designer action, with variable set data pill; then apply flow to all of the eighty catalog items"
    ],
    "ans": "C",
    "explaination": "create one variable set for the four variables; then add the variable set to each of the eighty catalog items"
  },
  {
    "que": "what is the best practice regarding data imports?",
    "opt": [
      "plan time before your import to remove obsolete or inaccurate data.",
      "use extremely large import sets, instead of multiple large import sets.",
      "adjust your transform maps, after the data is loaded into the target table",
      "create a new import set table for each new data load",
      "monitor data quality and clean imported data using the data scrub workspace"
    ],
    "ans": "A",
    "explaination": "plan time before your import to remove obsolete or inaccurate data."
  },
  {
    "que": "which service now resource can be used as a blueprint to map your IT services to servicenow?",
    "opt": [
      "Configuration management database (CMDB)",
      "now learning",
      "service now wiki",
      "service mapping guided setup",
      "common service data model (CSDM)",
      "IT service management (ITSM)"
    ],
    "ans": "E",
    "explaination": "common service data model (CSDM)"
  },
  {
    "que": "What are the steps for importing data using an import set?",
    "opt": [
      "Identify source: import transform map; run transformer; verify import",
      "Load the data; create transform map; transform data; clean up import table",
      "select source file; run auto map; transform data; clean up target table",
      "set up LDAP; run auto map; transform data; clean up target table"
    ],
    "ans": "B",
    "explaination": "Load the data; create transform map; transform data; clean up import table"
  },
  {
    "que": "you have been asked to create a way for users to order a new iPhone, but only if they get two levels of approval. the approvers and users should be automatically notified at each approval level. what feature would you use to manage the approvals and notification?",
    "opt": [
      "Flows",
      "approval criteria",
      "approval chains",
      "approval delegates",
      "parent child approvers"
    ],
    "ans": "A",
    "explaination": "Flows"
  },
  {
    "que": "when importing data, what happens to imported rows, if no coalesce field is specified?",
    "opt": [
      "all rows are treated as new records, but error will be flagged in the import log",
      "duplicate rows are rejected from the import",
      "all rows are treated as new records. no existing records were updated",
      "all rows or rejected from the import, as coalesce field is required"
    ],
    "ans": "C",
    "explaination": "all rows are treated as new records. no existing records were updated"
  },
  {
    "que": "what tool allows you to drag and drop to specify links between source fields on an import set table and destination fields on any servicenow table?",
    "opt": [
      "Mapping assist utility",
      "import workspace",
      "data source map",
      "import designer",
      "transform designer",
      "transform dashboard"
    ],
    "ans": "A",
    "explaination": "Mapping assist utility"
  },
  {
    "que": "when importing data from a spreadsheet which step defines where the incoming data columns will be written in the receiving tables?",
    "opt": [
      "schedule transform",
      "select data source",
      "field mapping",
      "load data",
      "create transform app"
    ],
    "ans": "C",
    "explaination": "field mapping"
  },
  {
    "que": "to quickly return to a homepage you were using 5 minutes ago, which item would you click?",
    "opt": [
      "gear icon",
      "clock icon",
      "right click history",
      "homepage icon",
      "history module",
      "start icon"
    ],
    "ans": "B",
    "explaination": "clock icon"
  },
  {
    "que": "what is the most important thing to remember about activating a plugin?",
    "opt": [
      "install dependent plugins first",
      "tick the box for adding demo data",
      "plugins once installed cannot be uninstalled",
      "submit HI ticket to get Authorization",
      "plugins are prohibited in personal developer instances"
    ],
    "ans": "C",
    "explaination": "plugins once installed cannot be uninstalled"
  },
  {
    "que": "Certain tables have a prefix like HR_. which kind of tables has a name that starts with a custom prefix?",
    "opt": [
      "excluded table",
      "scoped application table",
      "system table",
      "explanation table",
      "Xray search table"
    ],
    "ans": "B",
    "explaination": "scoped application table"
  },
  {
    "que": "within the report library, there are many baseline reports that can be used for learning about reports. what could you search for to locate ITIL best practice indicator reports?",
    "opt": [
      "KPI",
      "ITSM",
      "ITIL",
      "PA",
      "Sn_itil"
    ],
    "ans": "A",
    "explaination": "KPI"
  },
  {
    "que": "while on an incident record, how would you add a tag for 'special Handling' To the record?",
    "opt": [
      "click on the context menu, select add tag, type special handling, press enter",
      "on the special handling field, check the box",
      "on the tag field, select special handling from the choice list",
      "click on the …. icon, click add tag, type special handling, press enter"
    ],
    "ans": "D",
    "explaination": "click on the …. icon, click add tag, type special handling, press enter"
  },
  {
    "que": "when using context menu on list, form, and column headings, what are the quick way to access the menus? choose two answers?",
    "opt": [
      "right click on the list, form, or column heading",
      "click on context menu icon",
      "shift click on the list, form, or column heading",
      "double click on the list, form, or column heading.",
      "Ctrl M"
    ],
    "ans": "A,B",
    "explaination": "right click on the list, form, or column heading<br />click on context menu icon"
  },
  {
    "que": "which icon in the banner do you use to turn on the application picker and the update set picker?",
    "opt": [
      "Magnifier",
      "check box",
      "question mark",
      "Gear",
      "chat bubbles"
    ],
    "ans": "D",
    "explaination": "Gear"
  },
  {
    "que": "A new service desk employee in Latin America Complaints that the create dates and time are incorrect on their incident list. what would you suggest to fix this issue?",
    "opt": [
      "use the system properties to correct the instance time zone",
      "have them correct the time zone on their computer",
      "recommend they use Chrome instead of explorer",
      "Have them use the gear icon to set the employees time zone",
      "have them clear their cache"
    ],
    "ans": "D",
    "explaination": "Have them use the gear icon to set the employees time zone"
  },
  {
    "que": "A department uses SLA data extensively to run reports. they keep asking for help with building reports off of the same set of tables. they seem to be conducted by dot walking. What could you do to make it easier for them to build their reports?",
    "opt": [
      "System table flow house their reporting data",
      "write knowledge articles explaining how to do dot walking",
      "create a data source for them and show them how to use it",
      "send a team member to a reporting class knock out any untrained users",
      "show them how to export to excel format"
    ],
    "ans": "C",
    "explaination": "create a data source for them and show them how to use it"
  },
  {
    "que": "what are examples of core tables in the ServiceNow platform?",
    "opt": [
      "Team, party, awards",
      "User, task, incident",
      "Work, caller, timecard",
      "base configuration item, configuration item, base task"
    ],
    "ans": "B",
    "explaination": "User, task, incident"
  },
  {
    "que": "What are benefits of assigning work tasks to a group, rather than to an individual? choose five answers?",
    "opt": [
      "group members can avoid task which are nearing SLA breach",
      "group members can pick task based on the SLA urgency",
      "Site support members can pick task based on location",
      "groups can assign task to users based on on-call schedules",
      "group can assign task to users based on skills",
      "groups can assign task to user based on availability",
      "group members can pick task, based on highest priority",
      "group members can choose their preferred task from my groups works"
    ],
    "ans": "D,E,F,G,H",
    "explaination": "groups can assign task to users based on on-call schedules<br />group can assign task to users based on skills<br />groups can assign task to user based on availability<br />group members can pick task, based on highest priority<br />group members can choose their preferred task from my groups works"
  },
  {
    "que": "what sections on the CI form, can you find information about the other CIs associated with your CI?",
    "opt": [
      "related list",
      "related items",
      "affected CI tab",
      "related links",
      "child CI tab"
    ],
    "ans": "B",
    "explaination": "related items"
  },
  {
    "que": "A manager wants to run a report showing how many service requests have been fulfilled for business cards since the beginning of the year. what table would they select for building this report?",
    "opt": [
      "Request[sc_req]",
      "requested item[sc_req_item]",
      "task[task]",
      "catalog item[sc_cat_item]",
      "catalog task[sc_task]",
      "service catalog[sc_catalog]"
    ],
    "ans": "B",
    "explaination": "requested item[sc_req_item]"
  },
  {
    "que": "your customer requires that they be able to monitor which users are performing impersonation in their instance. what would you do to meet that requirement?",
    "opt": [
      "add the role log write[sn_Log_write] to the impersonator group",
      "activate the glide.sys.log_impersonation script",
      "create user update set for impersonation tracking",
      "on the impersonator role record, right click and select create log",
      "from the user icon, select elevate roles"
    ],
    "ans": "B",
    "explaination": "activate the glide.sys.log_impersonation script"
  },
  {
    "que": "sections on a form can appear as: one or two columns, tabs. From form designer, how do you define a section, so it displays as a tab?",
    "opt": [
      "name the section",
      "add_tab to the end of the section name",
      "add. tab to the end of the section name",
      "click context menu> configure tabs",
      "click the gear and check the tab option"
    ],
    "ans": "A",
    "explaination": "name the section"
  },
  {
    "que": "a manager is complaining that they can't get the data that they need on a report, because the data resides in two different tables. this data is used for many different reports in their department. you have checked to see if dot walking will meet the requirement and it is not possible. what else might you try to help this manager?",
    "opt": [
      "create a database view",
      "create a report source",
      "create a custom table",
      "export the tables to spreadsheet",
      "create a report template"
    ],
    "ans": "A",
    "explaination": "create a database view"
  },
  {
    "que": "tables can be characterised in multiple ways. which of this combination is impossible? choose 2 answers?",
    "opt": [
      "custom and core",
      "customer and child",
      "base and parent",
      "custom and parent",
      "core and base",
      "child and core",
      "custom and base",
      "parent and child"
    ],
    "ans": "A,H",
    "explaination": "custom and core<br />child and parent"
  },
  {
    "que": "What are advantages of using flow designer? choose three answers?",
    "opt": [
      "supports legacy workflows",
      "less manual scripting",
      "enables complicated scripting",
      "reduces technical debt",
      "supports advanced developers",
      "compliments the integration store",
      "smooth integration with 3rd party systems"
    ],
    "ans": "B,D,G",
    "explaination": "less manual scripting<br />reduces technical debt<br />smooth integration with 3rd party systems"
  },
  {
    "que": "what policies are applied to all data entered into the platform via form (UI), import sets or web services?",
    "opt": [
      "data submission policies",
      "data quality policies",
      "data integrity policies",
      "data policies",
      "write policies"
    ],
    "ans": "D",
    "explaination": "data policies"
  },
  {
    "que": "You have been asked to configure form so an Employee could order a tablet and select the standard accessory options to purchase with it. these Standard options are carrying case, screen cleaner, tablet stand, and screen protector. what approach would you take? choose three answers?",
    "opt": [
      "on shopping cart configuration, select options to show the add accessories button",
      "create one catalog item for each: tablet, carrying case, screen cleaner, tablet stand, and screen protector",
      "create catalog item for the tablet and add a variable set to the form for the accessory options",
      "Create a record producer and on the form, add a checkbox variable for each accessory options.",
      "create catalog item for the tablet, and on the form, add a checkbox variable for each accessory option"
    ],
    "ans": "C,D,E",
    "explaination": "create catalog item for the tablet and add a variable set to the form for the accessory options<br />Create a record producer and on the form, add a checkbox variable for each accessory options.<br />create catalog item for the tablet, and on the form, add a checkbox variable for each accessory option"
  },
  {
    "que": "when moving a homepage or dashboard between instances, what must you remember?",
    "opt": [
      "they are automatically added to the updates set",
      "create a separate update set for them",
      "they can be moved using zip files",
      "they cannot be moved via XML",
      "manually add them to the update set",
      "they cannot be moved via updates set"
    ],
    "ans": "E",
    "explaination": "manually add them to the update set"
  },
  {
    "que": "when be set up with many to many relationships. what is a classic example of a scenario where the tables could have many to many relationships?",
    "opt": [
      "A task can trigger many workflows and workflow can trigger many tasks",
      "vendors can sell multiple products and products can be sold by multiple vendors",
      "request can contain many items and items can be any item from the catalogs",
      "a configuration item can belong to multiple classes and classes can contain multiple configuration items"
    ],
    "ans": "B",
    "explaination": "vendors can sell multiple products and products can be sold by multiple vendors"
  },
  {
    "que": "Your customer wants to add the company’s email banner to each customer Facing email notification. how would you approach this requirement?",
    "opt": [
      "create a company HTTP email wrapper",
      "create a company email template",
      "create a company CSS package for emails",
      "create a company email header and footer"
    ],
    "ans": "D",
    "explaination": "create a company email header and footer"
  },
  {
    "que": "what catalog tool would you use to create a catalog item or record producer?",
    "opt": [
      "catalog formatter",
      "catalog flow builder",
      "catalog builder",
      "catalog designer",
      "variable designer",
      "form designer",
      "workflow designer"
    ],
    "ans": "C",
    "explaination": "catalog builder"
  },
  {
    "que": "On a form header, what icon would you Click to access template features?",
    "opt": [
      "paper clip",
      "stamp",
      "context menu",
      "more options (….)"
    ],
    "ans": "D",
    "explaination": "more options (….)"
  },
  {
    "que": "Which tab on the knowledge base record, would you use to identify the set of users who are able to read articles in that knowledge base?",
    "opt": [
      "can read",
      "access list",
      "accessible to",
      "can access"
    ],
    "ans": "A",
    "explaination": "can read"
  },
  {
    "que": "when adding a related list to a form, you choose the related list from the list collector. what is an example of a related list you might see on the list collector? choose 3 answers?",
    "opt": [
      "Outages > Task number",
      "catalog task > parent",
      "HR case > parent",
      "Problem == parent",
      "release phase == parent"
    ],
    "ans": "A,B,C",
    "explaination": "Outages > Task number<br />catalog task > parent<br />HR case > parent"
  },
  {
    "que": "in flow designer, where is the data from an action stored so it can be used in subsequent actions in the flow?",
    "opt": [
      "Data pill",
      "data trigger",
      "data element",
      "field icon",
      "field value"
    ],
    "ans": "A",
    "explaination": "Data pill"
  },
  {
    "que": "Which module would you use to create a new automation of business logic such as approvals, task and notifications?",
    "opt": [
      "Process Automation> active flows",
      "process automation> flow administration",
      "process automation> process flow",
      "process automation> workflow editor",
      "process automation> flow designer"
    ],
    "ans": "E",
    "explaination": "process automation> flow designer"
  },
  {
    "que": "what are the different types of data sources, which may be imported into servicenow? Choose 4 answers?",
    "opt": [
      "implementation spoke",
      "JDBC connection",
      "DataHub",
      "network server",
      "LDAP connection",
      "local sources (i.e., XML, CSV, excel)"
    ],
    "ans": "B,C,E,F",
    "explaination": "JDBC connection<br />DataHub<br />LDAP Connection<br />local sources (i.e., XML, CSV, excel)"
  },
  {
    "que": "What are the examples of UI actions relating to forms? Choose three answers?",
    "opt": [
      "form context menu",
      "form columns",
      "form links",
      "form buttons",
      "form View"
    ],
    "ans": "A,C,D",
    "explaination": "form context menu<br />form links<br />form buttons"
  },
  {
    "que": "Which icon would you double Click to expand and collapse the list of all applications and modules?",
    "opt": [
      "Funnel",
      "Clock",
      "Application",
      "Star"
    ],
    "ans": "C",
    "explaination": "Application"
  },
  {
    "que": "on what part of the service now instance, would you find the option to impersonate user?",
    "opt": [
      "content frame",
      "module",
      "application navigator",
      "banner"
    ],
    "ans": "D",
    "explaination": "banner"
  },
  {
    "que": "what are the main components of the form design interface? Choose 3 answers?",
    "opt": [
      "field picker",
      "field layout",
      "form layout",
      "page header",
      "field navigator"
    ],
    "ans": "C,D,E",
    "explaination": "form layout<br />page header<br />field navigator"
  },
  {
    "que": "what features are available in knowledge management to support continuous improvement on the knowledge articles? Choose 4 answers?",
    "opt": [
      "flag article",
      "tag as helpful",
      "submit KB Errata",
      "click frowning icon",
      "Add comments",
      "rate with stars"
    ],
    "ans": "A,B,E,F",
    "explaination": "flag articles<br />tag as helpful<br />Add comments<br />rate with stars"
  },
  {
    "que": "when a custom table is created, which access control rules are automatically created? Choose 4 answers?",
    "opt": [
      "Update",
      "Execute",
      "Create",
      "Read",
      "Delete",
      "Write"
    ],
    "ans": "C,D,E,F",
    "explaination": "Create<br />Read<br />Delete<br />Write"
  },
  {
    "que": "when you set a policy that is applied to all data entered into the platform (UI, import sets, or web services). where does this policy required the Default?",
    "opt": [
      "Network",
      "Server",
      "Client",
      "Browser"
    ],
    "ans": "C",
    "explaination": "Client"
  },
  {
    "que": "Which tool is used to define relationship between fields in an imports Set table and a target table?",
    "opt": [
      "schema map",
      "transform schema",
      "transform map",
      "field transformer"
    ],
    "ans": "C",
    "explaination": "transform map"
  },
  {
    "que": "How would you navigate to the schema map for a table?",
    "opt": [
      "system definitions> tables. select table. Go to related links and click show schema map",
      "system dictionary> show schema map. select table",
      "system definition> dictionary. select table. go to related links and click show schema map",
      "system definition> show schema map. select table"
    ],
    "ans": "A",
    "explaination": "system definitions> tables. select table. Go to related links and click show schema map"
  },
  {
    "que": "what feature allows you to limit users able to contribute or read knowledge within",
    "opt": [
      "a knowledge base?",
      "Roles",
      "user criteria",
      "categories",
      "groups"
    ],
    "ans": "B",
    "explaination": "Roles"
  },
  {
    "que": "What does natural language query allow you to do on a list?",
    "opt": [
      "set list filter, using audible commands",
      "filter list by typing in a phrase",
      "predict the filter desired by the user",
      "Speak to the condition builder",
      "automatically select a filter based on keywords"
    ],
    "ans": "B",
    "explaination": "filter list by typing in a phrase"
  },
  {
    "que": "your customer has a human resource knowledge base, which is only accessible to members of the human resource department. A new procedure regarding employee quarterly reviews needs to be published to the knowledge base but should be only visible to HR manager. how would you meet this requirement?",
    "opt": [
      "Add user criteria for HR manager group on the can read list of the article",
      "add user criteria for HR manager group on the categories can read list",
      "on the knowledge article, add an access control for HR manager group on the can read list, then publish article to any category.",
      "On the knowledge base, add user criteria with a manager can read script to the can read list, publish articles to any category"
    ],
    "ans": "A",
    "explaination": "Add user criteria for HR manager group on the can read list of the article"
  },
  {
    "que": "What type of entitles can receive task assignments, in servicenow? choose two answers?",
    "opt": [
      "Groups",
      "Departments",
      "Teams",
      "Users"
    ],
    "ans": "A,D",
    "explaination": "Groups<br />Users"
  },
  {
    "que": "what capability allows user to create dashboards with big widgets to visualise data over time in order to identify areas of improvement?",
    "opt": [
      "Reporting",
      "scheduled reports",
      "analytics reports",
      "performance analytics"
    ],
    "ans": "D",
    "explaination": "performance analytics"
  },
  {
    "que": "which would you follow when testing a catalogue item that has a manager approval flow? Choose three answers?",
    "opt": [
      "make sure the latest flows are activated.",
      "use the instance Incognito settings to quickly toggle between requester and approval",
      "use your admin account, so you can approve the items quickly",
      "impersonate the requester to ensure the form works",
      "make sure the requesters user record has manager specified",
      "Create and select your testing update set before starting the test cases."
    ],
    "ans": "C,D,E",
    "explaination": "use your admin account, so you can approve the items quickly<br />impersonate the requester to ensure the form works<br />make sure the requesters user record has manager specified"
  },
  {
    "que": "when designing a flow, how do you reference data from a record, in that flow?",
    "opt": [
      "Use the condition builder to specify the desired values",
      "drag the data pill onto the flow definition",
      "add the table reference using the slush bucket",
      "specify the source table on the data pill related list",
      "drag the table icon onto the flow definition"
    ],
    "ans": "B",
    "explaination": "drag the data pill onto the flow definition"
  },
  {
    "que": "after finishing your work on high security setting, what is a possible way to return to normal admin security levels?",
    "opt": [
      "Select global update set",
      "end impersonation",
      "use system administration> normal security module",
      "select normal role",
      "logout and back in"
    ],
    "ans": "E",
    "explaination": "logout and back in"
  },
  {
    "que": "access controls are evaluated in this order: 1. Match Object against table ACL 2. Match The object against field ACL. Within step one above, what order are the table ACLs evaluated?",
    "opt": [
      "general to specific: table ACL, table.field ACL, parent table. field ACL",
      "specific to general: table.field ACL, parent table.field ACL, * Field ACL",
      "top to bottom: wildcard table ACL, parent table ACL, table ACL",
      "bottom to top: table ACL, table. field ACL, parent table. field ACL",
      "specific to general: table ACL, parent table ACL, wildcard(*) ACL"
    ],
    "ans": "A",
    "explaination": "general to specific: table ACL, table.field ACL, parent table. field ACL"
  },
  {
    "que": "When selecting the target table for an import, which table can you select? choose three answers?",
    "opt": [
      "related tables, using dot walk",
      "tables outside of servicenow",
      "tables within the existing application scope",
      "tables within the global scope",
      "tables which allow write access to other applications"
    ],
    "ans": "C,D,E",
    "explaination": "tables within the existing application scope<br />tables within the global scope<br />tables which allow write access to other applications"
  },
  {
    "que": "A user wants to create a set of filter conditions, where they want to show records which satisfy two conditions: 1. incidents where the state is closed, 2. incidents where assignment group is network. after clicking the funnel icon, what should the user do?",
    "opt": [
      "define the first condition; click AND button; define second condition; click run",
      "define the first condition; click OR button; define second condition; press enter",
      "define the first condition; click> icon on breadcrumb, define second condition; press enter",
      "define the first condition; click> icon on breadcrumb, define second condition; click run",
      "define the first condition; click AND button; define second condition; press enter"
    ],
    "ans": "A",
    "explaination": "define the first condition; click AND button; define second condition; click run"
  },
  {
    "que": "What import utility does the system use when the field names on the import set match the name of the fields on the target table?",
    "opt": [
      "scheme mapping",
      "mapping assist tool",
      "automatic mapping",
      "mapping dashboard"
    ],
    "ans": "C",
    "explaination": "automatic mapping"
  },
  {
    "que": "Report designer contains different sections for configuring your report which section is used to adjust the look of your report, including colours, titles and legend layout?",
    "opt": [
      "Format",
      "Configure",
      "Layout",
      "Style"
    ],
    "ans": "D",
    "explaination": "Style"
  },
  {
    "que": "Which statement correctly describes the difference between a client script and a business rule?",
    "opt": [
      "Client scripting executes before a record is loaded and a business rule executes after a record is loaded",
      "a client script executes on the server and a business rule executes on the client",
      "a client script executes before a record is loaded and a business rule executes after",
      "a record is updated",
      "a client script executes on the client and a business rule executes on the server"
    ],
    "ans": "D",
    "explaination": "a client script executes on the client and a business rule executes on the server"
  },
  {
    "que": "What are the advantages of using flow designer? choose three answers?",
    "opt": [
      "reduces technical debt",
      "enables complicated scripting",
      "less manual scripting",
      "smooth integration with 3rd party system",
      "supports advanced developers"
    ],
    "ans": "A,C,D",
    "explaination": "reduces technical debt<br />less manual scripting<br />smooth integration with 3rd party system"
  },
  {
    "que": "What tool is used to import data from various data sources and map that data into servicenow tables?",
    "opt": [
      "Update set",
      "data pack",
      "import set",
      "transform set"
    ],
    "ans": "C",
    "explaination": "import set"
  },
  {
    "que": "How would you distinguish between a base class table and a parent class table?",
    "opt": [
      "extended tables can be extended from parent tables or base tables; but they cannot be extended from both.",
      "base class table is not extended from another table. parent class tables may be extended from another table",
      "base class tables always have tables extended from them. parent tables do not have tables extended from them",
      "extended tables are always extended from parent tables. extended tables are usually extended from base tables"
    ],
    "ans": "B",
    "explaination": "base class table is not extended from another table. parent class tables may be extended from another table"
  },
  {
    "que": "What are three security modules often used by the System Administrator? choose three answers?",
    "opt": [
      "system security> security",
      "system properties> security",
      "system security> high security settings",
      "self-service> my access",
      "system security> access control (ACL)"
    ],
    "ans": "B,C,E",
    "explaination": "system properties> security<br />system security> high security settings<br />system security> access control (ACL)"
  },
  {
    "que": "On a filter condition, which component is always a choice list?",
    "opt": [
      "Operator",
      "filter criteria",
      "match criteria",
      "operation"
    ],
    "ans": "A",
    "explaination": "Operator"
  },
  {
    "que": "Many actions are included with the flow designer, what are some frequently used core-actions? choose four answers?",
    "opt": [
      "look for update",
      "wait for condition",
      "create record",
      "look up record",
      "ask for approval",
      "wait for match"
    ],
    "ans": "B,C,D,E",
    "explaination": "wait for condition<br />create record<br />look up record<br />ask for approval"
  },
  {
    "que": "For your implementation, the following tables are extended from each other. 1) Incident table is extended from task table 2) super incident table is extended from incident table. in this situation, which tables are parent, child and base tables? choose five answers?",
    "opt": [
      "super incident table is a parent table",
      "super incident table is a child table",
      "task table is a child table",
      "super incident table is a base table",
      "task table is a parent table",
      "incident table is a base table",
      "task table is a base table",
      "incident table is a parent table",
      "incident table is a child table"
    ],
    "ans": "B,E,G,H,I",
    "explaination": "super incident table is a child table<br />task table is a parent table<br />task table is a base table<br />incident table is a parent table<br />incident table is a child table"
  },
  {
    "que": "Which is the most efficient way to move large amount of data between instances?",
    "opt": [
      "Update sets",
      "export to data package",
      "export to zip",
      "export to XML"
    ],
    "ans": "A",
    "explaination": "Update sets"
  },
  {
    "que": "Which service now utility gives a service desk agent the ability to trace from a service Having an issue, to see which Cis supporting that service have active issues?",
    "opt": [
      "CI health dashboard",
      "event management homepage",
      "service dashboard",
      "CI dependency view"
    ],
    "ans": "A",
    "explaination": "CI health dashboard"
  },
  {
    "que": "When importing spreadsheet data into service now, what is the first step in the process?",
    "opt": [
      "select coalesce",
      "select import set",
      "define data source",
      "run data scrabber",
      "load data"
    ],
    "ans": "E",
    "explaination": "load data"
  },
  {
    "que": "when managing tags, you can adjust who is able to see it. what are the visibility options? choose three answers?",
    "opt": [
      "Everyone",
      "groups and users",
      "me",
      "Admins",
      "Roles and permissions"
    ],
    "ans": "A,B,C",
    "explaination": "Everyone<br />groups and users<br />me"
  },
  {
    "que": "which modules can you use to create a new table? choose two answers?",
    "opt": [
      "tables and columns",
      "dictionary",
      "schema map",
      "tables"
    ],
    "ans": "A,D",
    "explaination": "tables and columns<br />tables"
  },
  {
    "que": "What service now feature allows you to include data from a secondary related table on a report?",
    "opt": [
      "outer join",
      "joins",
      "SQL",
      "dot walking"
    ],
    "ans": "D",
    "explaination": "dot walking"
  },
  {
    "que": "which of the following are not included in an update set by default? Choose 3 Answers?",
    "opt": [
      "Business rules",
      "Schedules",
      "scheduled jobs",
      "transcripts",
      "home pages",
      "data"
    ],
    "ans": "B,C,E",
    "explaination": "Schedules<br/>scheduled jobs<br/>home pages"
  },
  {
    "que": "what options can you see, when you right click on a CI, from the CI dependency view map? choose three answers?",
    "opt": [
      "view affected Cis",
      "view cases",
      "view related tasks",
      "view recent outages",
      "view knowledge"
    ],
    "ans": "A,C,D",
    "explaination": "view affected Cis<br />view related tasks<br />view recent outages"
  },
  {
    "que": "you have heard about a new application released by service now. you want to try it out, to see if it might be useful for your company’s service now implementation. what would be the best way to get hands on experience with the new application?",
    "opt": [
      "active the application plug in, on your personal dev instance",
      "check the latest release notes on docs.servicenow.com",
      "search the wiki for sales demo request form",
      "Activate the application plug in, on your company’s production instance."
    ],
    "ans": "A",
    "explaination": "active the application plug in, on your personal dev instance"
  },
  {
    "que": "On a filter condition, there is an element, which is based on the table, the user access rights, and column on the table. what is this element called?",
    "opt": [
      "Column",
      "Field",
      "data element",
      "attribute",
      "label"
    ],
    "ans": "B",
    "explaination": "Field"
  },
  {
    "que": "which module would you use to customize your instance banner image, text and colours?",
    "opt": [
      "service portal> portals> branding",
      "system properties> basic configuration UI16",
      "system UI> UI pages> branding",
      "home page admin> pages> branding",
      "system properties> branding"
    ],
    "ans": "B",
    "explaination": "system properties> basic configuration UI16"
  },
  {
    "que": "Which service now capability provides assistance to help users obtain information, make decisions and perform common work task via messaging interface?",
    "opt": [
      "Knowledge chat",
      "virtual agent",
      "now support",
      "chat box",
      "agent workspace"
    ],
    "ans": "B",
    "explaination": "virtual agent"
  },
  {
    "que": "service now contains over 25 different report types. what are some of the types? choose five answers?",
    "opt": [
      "Semi-donut",
      "Speedometer",
      "Donut",
      "Thermometer",
      "Pie",
      "Horizontal Bar",
      "Odometer"
    ],
    "ans": "A,B,C,E,F",
    "explaination": "Semi-donut<br />Speedometer<br />Donut<br />Pie<br />Horizontal Bar"
  },
  {
    "que": "On the CI dependency view, what enables you to trace from an infrastructure item, like a server, to the server that dependent on that server?",
    "opt": [
      "Transform app",
      "Relationships",
      "automapping utility",
      "service tracer"
    ],
    "ans": "B",
    "explaination": "Relationships"
  },
  {
    "que": "which one statement correctly describes access control rule evalution?",
    "opt": [
      "roles are evaluated from the general to specific, so a table rule must be active to continue.",
      "if a row level rule and a field level rule exist, both rules must be true before an operation is allowed",
      "rules are evaluated using roles. the role with the most permissions evaluates the rules first",
      "if more than one rules applies to a row, the older rule is evaluated first"
    ],
    "ans": "B",
    "explaination": "if a row level rule and a field level rule exist, both rules must be true before an operation is allowed"
  },
  {
    "que": "Which one of the following describe the primary operations performed against tables in the service now platform?",
    "opt": [
      "create, read, upload, delete",
      "capture, rate, write, develop",
      "create, rate, update, delete",
      "create, read, write, delete"
    ],
    "ans": "D",
    "explaination": "create, read, write, delete"
  },
  {
    "que": "what are advantages of using spokes for integration? Choose 3 answers?",
    "opt": [
      "free spokes are available in the ServiceNow store",
      "reduces the need for code",
      "features scale and control mechanism",
      "ensures discoverability and reuse",
      "automated event management"
    ],
    "ans": "A,B,E",
    "explaination": "free spokes are available in the ServiceNow store<br />reduces the need for code<br />automated event management"
  },
  {
    "que": "when looking at a long list of records, you want to quickly filter, to show only those which have short description containing email. how might you do that?",
    "opt": [
      "on search box, select text, type email, click enter",
      "click list magnifier to expand column search, on short description, type email, click enter",
      "click list magnifier to expand column search, on short description, type %email, click enter",
      "click list magnifier to expand column search, on short description, type *email, click enter"
    ],
    "ans": "D",
    "explaination": "click list magnifier to expand column search, on short description, type *email, click enter"
  },
  {
    "que": "a task worker asks how they can monitor any updates occurring to records assigned to him, like responses from customers. what do you suggest?",
    "opt": [
      "on my work list, select activity stream icon to show a frame with live updates",
      "select service desk> my work dashboard",
      "open an agent workspace tab for each record he wants to monitor",
      "click on the eyeglass icon to expand the monitor frame"
    ],
    "ans": "A",
    "explaination": "on my work list, select activity stream icon to show a frame with live updates"
  },
  {
    "que": "you have an existing customer, who is using work floors for their catalog item. Existing purchasing policies to require approval for any request that totals over $1000. However, management wants to change the approval threshold to $1500. which workflow would you update to make this change?",
    "opt": [
      "service approval processing",
      "purchasing process flow",
      "service catalog request",
      "service catalog item request"
    ],
    "ans": "C",
    "explaination": "service catalog request"
  },
  {
    "que": "after you create a new table, what is the best practice regarding the navigation pane? Choose 2 answers?",
    "opt": [
      "create application menu with the same name as the table label",
      "set the font style on both the application menu and the module",
      "specify which roles are able to see the module",
      "set the filter condition on the application module",
      "Create module with the plural of the table label",
      "specify which roles are able to see the application menu"
    ],
    "ans": "A,E",
    "explaination": "create application menu with the same name as the table label<br />Create module with the plural of the table label"
  },
  {
    "que": "What Icon do you use to change the label on your favorite?",
    "opt": [
      "Triangle",
      "Star",
      "Clock",
      "Pencil"
    ],
    "ans": "D",
    "explaination": "Pencil"
  },
  {
    "que": "What is the platform name for the group table?",
    "opt": [
      "Group",
      "Sys_user_group",
      "Sys_group",
      "Sys_groups"
    ],
    "ans": "B",
    "explaination": "Sys_user_group"
  },
  {
    "que": "from a form, what would you Click to modify the order of the fields on the form? Choose 2 answers?",
    "opt": [
      "context menu> configure> form layout",
      "context menu> configure> form designer",
      "right click on header> configure> form design",
      "context menu> form> layout",
      "right click on header> configure>UX dashboard"
    ],
    "ans": "A,C",
    "explaination": "context menu> configure> form layout<br />right click on header> configure> form design"
  },
  {
    "que": "On access control definitions, what are ways you can set the permissions on a table? Choose 3 answers?",
    "opt": [
      "Groups",
      "Roles",
      "script that sets the answer variable to true or false",
      "CRUD",
      "conditional expressions"
    ],
    "ans": "B,C,E",
    "explaination": "Roles<br />script that sets the answer variable to true or false<br />conditional expressions"
  },
  {
    "que": "What is used to determine user access to knowledge bases or a knowledge article?",
    "opt": [
      "read access flag",
      "privacy settings",
      "user criteria",
      "sn_kb_read, sn_article_read"
    ],
    "ans": "C",
    "explaination": "user criteria"
  },
  {
    "que": "What is the result of the order in which access controls are evaluated?",
    "opt": [
      "Ensures user has access to the application, before evaluating access to a module",
      "within the application",
      "ensures user has access to the fields in a table, before considering their access to",
      "the table",
      "Ensures user has access to a table, before evaluating access to a field in the table",
      "ensures user can get to work as quickly as possible."
    ],
    "ans": "C",
    "explaination": ""
  },
  {
    "que": "what is a no-code approach to control the mandatory or read only state of a form field?",
    "opt": [
      "Client script",
      "UI action",
      "UI policy",
      "UI Rule",
      "UI Script"
    ],
    "ans": "C",
    "explaination": ""
  },
  {
    "que": "Which module is used as the first step for importing data?",
    "opt": [
      "Transform data",
      "coalesce data",
      "Load data",
      "import data"
    ],
    "ans": "C",
    "explaination": ""
  },
  {
    "que": "Which tool graphically displays an infrastructure view for a configuration item (CI) and Its relationship with the other CIs?",
    "opt": [
      "Schema map",
      "dependency view",
      "dependency map",
      "database view"
    ],
    "ans": "B",
    "explaination": ""
  },
  {
    "que": "Group records are stored in which table?",
    "opt": [
      "Group[sys_user_group]",
      "Group[s_sys_group]",
      "Group[u_sys_group]",
      "Group[sn_sys_group]"
    ],
    "ans": "A",
    "explaination": ""
  },
  {
    "que": "What is the most common role that has access to almost all platform features, Functions and data?",
    "opt": [
      "security admin[security_admin]",
      "System Administrator[admin]",
      "Sys admin[sys_admin]",
      "Admin[sn_admin]",
      "Base admin[base_admin]"
    ],
    "ans": "B",
    "explaination": ""
  },
  {
    "que": "What service now features can be triggered by events, and is used to inform users about activities or updates in service now?",
    "opt": [
      "Emails",
      "Texts",
      "Alerts",
      "Events",
      "Notifications"
    ],
    "ans": "E",
    "explaination": ""
  },
  {
    "que": "The serviceNow platform includes which type of interfaces? Choose 3 answers?",
    "opt": [
      "black office dashboard",
      "Now mobile apps",
      "service portals",
      "field service task board",
      "now platform user interfaces",
      "agent Control Center"
    ],
    "ans": "B,C,E",
    "explaination": ""
  },
  {
    "que": "An IT manager is responsible for the network and hardware assignment groups, each group contains 5 team members. These team members are working on many tasks, but the manager cannot see any tasks on the service desk > My Groups Work List. What could explain this?",
    "opt": [
      "the manager is not a member of the network and hardware groups.",
      "the assignment group manager field is empty.",
      "the manager is not a member of the service desk group",
      "the manager does not have the ITIL role."
    ],
    "ans": "A",
    "explaination": ""
  },
  {
    "que": "You are showing your customer a new form that you have created for their new application. they would like to add a field to the form. where could you do that? Choose 2 answers?",
    "opt": [
      "select fields and columns module",
      "select field class manager module",
      "click on context menu, select configure > form design",
      "right click on the form header, select configure > form layout"
    ],
    "ans": "C,D",
    "explaination": ""
  },
  {
    "que": "A role is defined as what?",
    "opt": [
      "A persona in a workflow",
      "a set of user access policies",
      "a collection of permissions",
      "a set of access control rules"
    ],
    "ans": "C",
    "explaination": ""
  },
  {
    "que": "Which application is used primarily to load data into service now?",
    "opt": [
      "data import configuration",
      "system import sets",
      "import management",
      "import hub"
    ],
    "ans": "B",
    "explaination": ""
  },
  {
    "que": "what are the three key tables in an enterprise CMDB? Choose 3 answers?",
    "opt": [
      "Sn_cmdb_bak",
      "Sn_cmdb_ci",
      "Cmdb_rel_ci",
      "Cmdb_bak",
      "Cmdb_ci",
      "Cmdb",
      "Sn_cmdb"
    ],
    "ans": "C,E,F",
    "explaination": ""
  },
  {
    "que": "How would you define an access control, to allow a user with itil role to have permission to create incident records?",
    "opt": [
      "Name: incident.none; operation: create; role: itil",
      "Name: incident. *; operation: write; Permission: itil",
      "Name: incident.none; permission: create; role: itil",
      "Name: incident. *; Permission: write; role: itil",
      "Name: incident.Any; operation: write; Permission: itil"
    ],
    "ans": "A",
    "explaination": ""
  },
  {
    "que": "What do you activate when you want to add applications or functionality within your development instance?",
    "opt": [
      "Patch",
      "app updated set",
      "app package",
      "plugin",
      "updated pack"
    ],
    "ans": "D",
    "explaination": ""
  },
  {
    "que": "from a form, what would you Click to add additional fields to the form? Choose 2 answers?",
    "opt": [
      "right click on header > add > field",
      "context menu > form > layout",
      "context menu > configure > form design",
      "context menu > configure > Form layout",
      "context menu > form > designer",
      "right click on header > configure > UX dashboard"
    ],
    "ans": "C,D",
    "explaination": ""
  },
  {
    "que": "what resource can you use to view details of the tables and configuration items (CIs) associated with a particular use case?",
    "opt": [
      "scenario dashboard",
      "how much service data model (CSDM) Product View",
      "CMDB Use Case Modeler",
      "CI Use Case Modeler"
    ],
    "ans": "B",
    "explaination": ""
  },
  {
    "que": "service now contains a resource which provides the following: 1) A standard and shared set of service related definition across service now products and platforms that will enable and support true service level reporting. 2) A CMDB framework across our products and platforms that will enable and support multiple configuration strategies. what resource do these statements describe?",
    "opt": [
      "information technology infrastructure library (ITIL)",
      "configuration management database (CMDB)",
      "common service data model (CSDM)",
      "information technology service management (ITSM)"
    ],
    "ans": "C",
    "explaination": ""
  },
  {
    "que": "you are asked to create an option in the service catalog, which will allow a user to click get help and describe the issue they are having. these forms should create incident records which are automatically routed to the service desk, which method would you use?",
    "opt": [
      "create record producer",
      "create content item",
      "create catalog item",
      "create order guide"
    ],
    "ans": "A",
    "explaination": ""
  },
  {
    "que": "what type of query allows you to filter list data using normal words, instead of the condition builder?",
    "opt": [
      "natural language query",
      "Alexa query",
      "auto suggest query",
      "machine learning query",
      "predictive intelligence query"
    ],
    "ans": "A",
    "explaination": ""
  },
  {
    "que": "what is the best practice related to using the default update set for moving customization and instances?",
    "opt": [
      "you should not use the default update sets for moving between instances",
      "keep default updates set to maximum of 20 records, for troubleshooting purposes.",
      "submit default updates set to application repository",
      "merge default update sets before moving between instances"
    ],
    "ans": "A",
    "explaination": ""
  },
  {
    "que": "What is the name of the table relationship, where two or more tables are related in a bidirectional relationship, so that the related records are visible from both tables in a related list?",
    "opt": [
      "Database view",
      "Extended",
      "many to many",
      "one to many"
    ],
    "ans": "C",
    "explaination": ""
  },
  {
    "que": "What function do you use to add buttons, links, and context menu items on forms and list?",
    "opt": [
      "UI policies",
      "UI actions",
      "UI settings",
      "UI config"
    ],
    "ans": "B",
    "explaination": ""
  },
  {
    "que": "what feature do you use to specify which users are you able to access a service catalog item?",
    "opt": [
      "Can order tab.",
      "catalog user role",
      "can read role",
      "User criteria"
    ],
    "ans": "D",
    "explaination": ""
  },
  {
    "que": "Tables may have a one-to-many relationship. from the service catalog, what are examples of tables having a one-to-many relationship? Choose 3 answers?",
    "opt": [
      "one cart can have many requests",
      "one request can have many requested items",
      "one approval can have many requests",
      "one requested item can have many approvals",
      "one requested item can have many catalog tasks"
    ],
    "ans": "B,D,E",
    "explaination": ""
  },
  {
    "que": "On a form header, what is the three-bar icon called?",
    "opt": [
      "hamburger icon",
      "pancake icon",
      "cake icon",
      "additional actions or context menu"
    ],
    "ans": "D",
    "explaination": ""
  },
  {
    "que": "a user is complaining that they are seeing a blank page, when they click create new, from your custom inventory application. you have confirmed that they can see the inventory application, and the create new module on the application navigator. what could be the cause of this issue?",
    "opt": [
      "create new module has a broken link",
      "user should be using Chrome instead of explorer for their browser.",
      "user has read role, but not the write role on the inventory table",
      "known intermittent issues with UI15",
      "user session has timed out"
    ],
    "ans": "C",
    "explaination": ""
  },
  {
    "que": "which service now capability allows you to provide knowledge articles, via a conventional messaging interface?",
    "opt": [
      "Virtual agent",
      "now messenger",
      "agent assist",
      "connect agent"
    ],
    "ans": "A",
    "explaination": ""
  },
  {
    "que": "when moving multiple update sets at one time, what might you do to facilitate the move?",
    "opt": [
      "Preview",
      "Test",
      "Batch",
      "Verify"
    ],
    "ans": "C",
    "explaination": ""
  },
  {
    "que": "what are the components that make up a filter condition? Choose 3 answers?",
    "opt": [
      "Field",
      "Column",
      "Value",
      "Operator",
      "match criteria"
    ],
    "ans": "A,C,D",
    "explaination": ""
  },
  {
    "que": "When impersonating a user for testing purpose, what is the best way to return the instance, logged in with in your user account?",
    "opt": [
      "logout and back in",
      "turn your computer off and on again",
      "clear browser cache",
      "end impersonation"
    ],
    "ans": "D",
    "explaination": ""
  },
  {
    "que": "What type of field has a drop down list, from which you can pick from predefined options?",
    "opt": [
      "drop down",
      "option",
      "choice",
      "picker"
    ],
    "ans": "C",
    "explaination": ""
  },
  {
    "que": "a customer requests the following data quality measures to be added: 1. incident number should be read only on all list and forms, For all users. 2. short description field should be mandatory, on all records, across all applications, on insert. which type of policy would you use to meet this requirement?",
    "opt": [
      "dictionary design policy",
      "data quality policy",
      "field criteria policy",
      "data policy"
    ],
    "ans": "D",
    "explaination": ""
  },
  {
    "que": "User records are stored in which table?",
    "opt": [
      "User[sys_user]",
      "User[sn_user]",
      "User[u_sys_user]",
      "User[s_user]"
    ],
    "ans": "A",
    "explaination": ""
  },
  {
    "que": "Your Customer would like to create a new templates to notify users who are affected by network outage at their site. which module would you use to create a new notification?",
    "opt": [
      "system properties > email > settings",
      "administration > notification overview",
      "user preferences > email > notifications",
      "system notification > email > notifications",
      "click gear > notifications > new"
    ],
    "ans": "D",
    "explaination": ""
  },
  {
    "que": "Two departments (HR onboarding and facilities) have come to you, asking for a way for employees to request event room setup services. The requirements are the same for the form and the task routing to the facilities assignment group. 1) For HR, the item will be used primarily for the onboarding condition, for employees orientation sessions. 2) for facilities, the item will be used for anyone in the company who needs room setup services. However, both departments have their own service catalogs. what do you do, to support these requirements?",
    "opt": [
      "create one catalog item for event room setup; then use ACLs to control access.",
      "create one catalog item for HR event room setup and one for facilities even room setup; then publish each to the appropriate catalog",
      "create one catalog item for event room setup; then publish to the parent catalogue, which is accessible to both HR and facilities.",
      "create one catalogue item for event room setup; then publish to both catalogs."
    ],
    "ans": "D",
    "explaination": ""
  },
  {
    "que": "Which of the following is best practice when configuring assignment rules or predictive intelligence? (select 4)",
    "opt": [
      "Setting an assignment group and user based on category and subcategory",
      "Setting a user based on category and subcategory",
      "Setting a user and assignment group based on short description",
      "Setting an assignment group based on category and subcategory"
    ],
    "ans": "A,B,C,D",
    "explaination": "Setting an assignment group and user based on category and subcategory<br />Setting a user based on category and subcategory<br />Setting a user and assignment group based on short description<br />Setting an assignment group based on category and subcategory"
  },
  {
    "que": "Which of the following are four ways team members can collaborate on tasks?",
    "opt": [
      "User presence",
      "Activity stream",
      "Work notes",
      "Connect chat"
    ],
    "ans": "A,B,C,D",
    "explaination": "User presence<br />Activity stream<br />Work notes<br />Connect chat"
  },
  {
    "que": "Which of the following are possible methods of populating a knowledge base with knowledge articles?",
    "opt": [
      "Integrating with a WebDAV compliant source",
      "Creating articles directly in the platform",
      "Importing Microsoft word files",
      "Benefits of using spokes"
    ]
  },
  {
    "que": "Which of the following are valid report sharing options?",
    "opt": [
      "publish",
      "export to pdf",
      "share",
      "add to dashboard",
      "schedule"
    ],
    "ans": "A,B,C,D,E",
    "explaination": "publish<br />export to pdf<br />share<br />add to dashboard<br />schedule"
  },
  {
    "que": "What are some of the benefits of branding your instance?",
    "opt": [
      "Gain user trust",
      "Accelerate adoption rates",
      "Create a shared identity"
    ],
    "ans": "A,B,C",
    "explaination": "Gain user trust<br />Accelerate adoption rates<br />Create a shared identity"
  },
  {
    "que": "When using form designer, icons presented on each field include which of the following?",
    "opt": [
      "Edit, Remove, Handle icons"
    ],
    "ans": "A",
    "explaination": "Edit, Remove, Handle icons"
  },
  {
    "que": "Different form templates can be applied to a form by accessing what?",
    "opt": [
      "Template bar"
    ],
    "ans": "A",
    "explaination": "Template bar"
  },
  {
    "que": "When configuring an email notification, where can you choose field values from the record to include in the message?",
    "opt": [
      "Select variables"
    ],
    "ans": "A",
    "explaination": "Select variables"
  },
  {
    "que": "Which feature allows users to manage which notifications they receive about various activities occurring on the platform?",
    "opt": [
      "Subscriptions"
    ],
    "ans": "A",
    "explaination": "Subscriptions"
  },
  {
    "que": "Where can users set their notification subscription preferences?",
    "opt": [
      "System settings"
    ],
    "ans": "A",
    "explaination": "System settings"
  },
  {
    "que": "What is the recommended way to share a report?",
    "opt": [
      "Share the report"
    ],
    "ans": "A",
    "explaination": "Share the report"
  },
  {
    "que": "Which feature allows end users to post questions and other questions?",
    "opt": [
      "Social Q&A"
    ],
    "ans": "A",
    "explaination": "Social Q&A"
  },
  {
    "que": "What item in the Knowledge Management Service Portal displays articles that have the highest percentage of users marking them helpful?",
    "opt": [
      "Most useful"
    ],
    "ans": "A",
    "explaination": "Most useful"
  },
  {
    "que": "What is the best way to share a knowledge article with another user?",
    "opt": [
      "a permalink"
    ],
    "ans": "A",
    "explaination": "a permalink"
  }
]